# 1. Напишите программу, которая принимает на вход вещественное число
#  и показывает сумму его цифр.

# in -> out
# - 6782 -> 23
# - 0.67 -> 13
# - 198.45 -> 27

num = float(input("Введите вещественное число: "))
num = num if num>=0 else -num

def count_digit(num): # определение количества цифр в дробной части ---------------------------------
    count = 0
    remains = num % 1
    while remains > 1e-10:
        count += 1
        remains = (num*10**count) % 1
    return count
# end  ----------------------------------------------------------------------------------------------


def summ_digits(num):  # сумма цыфр числа ---------------------------------------------------------
    count_remains = count_digit(num)
    sum = 0
    num = int(num*10**count_remains)
    while num > 0:
        sum += num % 10
        num = num//10
    return sum
# end  ----------------------------------------------------------------------------------------------


sum = summ_digits(num)
print(f"Сумма цифр числа {num} - {sum}")
