# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, 
# ключи — первые буквы имён, значения — списки, содержащие имена,
#  начинающиеся с соответствующей буквы.

# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"

# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'],
#  'П': ['Петр', 'Петр']}


st= ["Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка" ]
#st=[input(f"Ведите имя {x+1}: ") for x in range(int(input("ведите кол-во имен: "))) ]

st.sort()
new_dic = {j[0]: [i for i in st if j[0] == i[0]] for j in st}
print(new_dic)

